# Data cleaning และ Data preparation

ในกระบวนการของ Data Analysis ส่วนใหญ่จะใช้เวลาไปกับการเตรียมข้อมูล 

เช่น การ load, clean, transform และ rearrange ข้อมูลให้อยู่ในรูปแบบที่พร้อมต่อการวิเคราะห์

โดยที่ Pandas library ได้เตรียมความสามารถต่าง ๆ เหล่านี้ไว้ให้ ที่สำคัญทำงานได้อย่างมีประสิทธิภาพอีกด้วย

In [67]:
import numpy as np
import pandas as pd

## การจัดการ Missing value หรือ data

เริ่มต้นด้วยการตรวจสอบข้อมูลว่ามี missing value หรือไม่ 
* NA = Not Available
* NaN = Not a Number

In [5]:
samples = pd.Series(['A', 'B', 'C', np.nan, 'D'])
samples

0      A
1      B
2      C
3    NaN
4      D
dtype: object

In [6]:
samples.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [9]:
samples[0] = None  #None in Python
samples.isnull()

0     True
1    False
2    False
3     True
4    False
dtype: bool

ใน Pandas library ยังมี function อื่น ๆ ในการจัดการ Missing data อีก ประกอบไปด้่วย
* dropna()
* fillna()
* isnull()
* notnull()

In [11]:
samples.dropna()

1    B
2    C
4    D
dtype: object

In [13]:
samples.notnull()

0    False
1     True
2     True
3    False
4     True
dtype: bool

## ทำการกรอง Missing data ออกไป
สามารถใช้ได้ทั้ง isnull() และ dropna() ยกตัวอย่างเช่น

In [71]:
from numpy import nan as NA
data = pd.Series([1, 2, NA, 4, NA])
data

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [17]:
data.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [20]:
data.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [21]:
# Put your code

0    1.0
1    2.0
3    4.0
dtype: float64

### มาจัดการ missing data ใน DataFrame กันบ้าง

In [24]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
clean_data = data.dropna()
clean_data

     0    1    2
0  1.0  6.5  3.0

จะพบว่า ข้อมูลที่มีค่าเป็น NaN จะถูกเอาออกไปทั้ง row !!

แต่ถ้าเราต้องการในลบข้อมูลที่ทั้ง row ต้องเป็น NaN เท่านั้น สามารถใส่ parameter how=all ไปดังนี้

In [28]:
clean_data = data.dropna(how='all')
clean_data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

อีกทั้งยังสามารถลบ column ที่เป็น NaN ทั้งหมดได้อีก ด้วยการใส่ parameter axis=1 ไปดังนี้

In [31]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [32]:
clean_data = data.dropna(axis=1, how='all')
clean_data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### คำถาม ต้องการกรองข้อมูลเฉพาะ row มีค่า NaN ไม่เกิน 2 ค่า ?
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html

In [50]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [49]:
# Put your code

     0    1    2   4
0  1.0  6.5  3.0 NaN
3  NaN  6.5  3.0 NaN

### ถ้าไม่ต้องกรองข้อมูลออก เราสามารถแก้ไขหรือเปลี่ยนค่าของ missing value ได้
สามารถใช้งานด้วย function fillna() ด้วยการระบุค่าที่ต้องการใส่แทน missing value

In [63]:
data = pd.DataFrame(np.random.randn(7, 3))
data.iloc[:5, 1] = NA
data.iloc[:2, 2] = NA
data

          0         1         2
0 -0.258738       NaN       NaN
1  1.780211       NaN       NaN
2 -1.297301       NaN -0.469925
3 -0.789498       NaN -0.018596
4  0.502193       NaN -0.405563
5  0.256412 -0.342062 -0.823014
6 -1.348614  0.294870  0.667151

In [64]:
data.fillna(0)

          0         1         2
0 -0.258738  0.000000  0.000000
1  1.780211  0.000000  0.000000
2 -1.297301  0.000000 -0.469925
3 -0.789498  0.000000 -0.018596
4  0.502193  0.000000 -0.405563
5  0.256412 -0.342062 -0.823014
6 -1.348614  0.294870  0.667151

ทำการกำหนดแยกแต่ละ index หรือ column ได้อีกด้วย

สามารถใส่ parameter ในรูปแบบของ dictionary ได้ดังนี้

In [66]:
data.fillna({1: 0.50, 2: 0})

          0         1         2
0 -0.258738  0.500000  0.000000
1  1.780211  0.500000  0.000000
2 -1.297301  0.500000 -0.469925
3 -0.789498  0.500000 -0.018596
4  0.502193  0.500000 -0.405563
5  0.256412 -0.342062 -0.823014
6 -1.348614  0.294870  0.667151

### ในบางครั้งไม่ต้องการแทนที่ด้วยค่าที่กำหนด  แต่ต้องการใช้ค่าก่อนหน้า
โดยสามารถทำได้ใส่ parameter method เข้าไปใน fillna() ได้ดังนี้

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html#pandas.DataFrame.fillna

In [75]:
data = pd.DataFrame(np.random.randn(6, 3))
data.iloc[2:, 1] = NA
data.iloc[4:, 2] = NA
data

          0         1         2
0 -0.916727  0.856784 -0.700570
1  0.372459 -1.816907  0.729030
2 -0.026176       NaN -0.484983
3 -0.228528       NaN  0.160589
4 -0.873237       NaN       NaN
5 -0.919630       NaN       NaN

In [76]:
data.fillna(method='ffill')

          0         1         2
0 -0.916727  0.856784 -0.700570
1  0.372459 -1.816907  0.729030
2 -0.026176 -1.816907 -0.484983
3 -0.228528 -1.816907  0.160589
4 -0.873237 -1.816907  0.160589
5 -0.919630 -1.816907  0.160589

In [77]:
# Put your code

          0         1         2
0 -0.916727  0.856784 -0.700570
1  0.372459 -1.816907  0.729030
2 -0.026176 -1.816907 -0.484983
3 -0.228528 -1.816907  0.160589
4 -0.873237       NaN  0.160589
5 -0.919630       NaN  0.160589

มีอีกหลายแนวทางในการใส่ข้อมูลขอ missing data 

ยกตัวอย่างเช่น ค่า median ของ column ที่ต้องการ

In [87]:
data.fillna(data[1].mean())

          0         1         2
0 -0.916727  0.856784 -0.700570
1  0.372459 -1.816907  0.729030
2 -0.026176 -0.480062 -0.484983
3 -0.228528 -0.480062  0.160589
4 -0.873237 -0.480062 -0.480062
5 -0.919630 -0.480062 -0.480062

In [91]:
# Put your code

          0         1         2
0 -0.916727  0.856784 -0.700570
1  0.372459 -1.816907  0.729030
2 -0.026176 -0.480062 -0.484983
3 -0.228528 -0.480062  0.160589
4 -0.873237 -0.480062 -0.073984
5 -0.919630 -0.480062 -0.073984

## Data transformation
เริ่มด้วยการลบข้อมูลที่ซ้ำซ้อน ซึ่งพบเป็นประจำสำหรับข้อมูล

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop_duplicates.html#pandas.DataFrame.drop_duplicates

In [110]:
data = pd.DataFrame( { "key 1": ['A', 'B', 'C'] * 3 + ['A'],
                       "key 2": [1,2,3,4,5,6,7,8,9] + [1]
                     } )
data

  key 1  key 2
0     A      1
1     B      2
2     C      3
3     A      4
4     B      5
5     C      6
6     A      7
7     B      8
8     C      9
9     A      1

In [111]:
# Check duplicated data in DataFrame
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [112]:
# Drop duplicated row
data.drop_duplicates()

  key 1  key 2
0     A      1
1     B      2
2     C      3
3     A      4
4     B      5
5     C      6
6     A      7
7     B      8
8     C      9

In [119]:
data['new key'] = range(10)
data

  key 1  key 2  new key
0     A      1        0
1     B      2        1
2     C      3        2
3     A      4        3
4     B      5        4
5     C      6        5
6     A      7        6
7     B      8        7
8     C      9        8
9     A      1        9

In [123]:
# Check duplicate by column
data.drop_duplicates(['key 1'])

  key 1  key 2  new key
0     A      1        0
1     B      2        1
2     C      3        2

In [124]:
# Put your code

  key 1  key 2  new key
7     B      8        7
8     C      9        8
9     A      1        9

## Data transform ด้วยการ mapping ในแต่ละ Series

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.map.html#pandas.Series.map

In [136]:
data = pd.DataFrame( { 'food': ['bacon', 'Bacon', 'Ham', 'beef', 'pastrami'],
                       'value': np.random.randn(5)
                     } )
data

       food     value
0     bacon  0.222529
1     Bacon -1.860901
2       Ham -0.314750
3      beef  2.269789
4  pastrami  0.767087

ต้องการ mapping ข้อมูลดังนี้
* bacon, Ham คือ pig
* beef, pastrami คือ cow

จะต้องทำการ transform ข้อมูลใน DataFrame อย่างไร ?

In [131]:
lowercase_data = data['food'].str.lower()
lowercase_data

0       bacon
1       bacon
2         ham
3        beef
4    pastrami
Name: food, dtype: object

In [132]:
mapping = { 'bacon': 'pig', 'ham': 'pig', 'beef': 'cow', 'pastrami': 'cow' }
lowercase_data.map(mapping)

0    pig
1    pig
2    pig
3    cow
4    cow
Name: food, dtype: object

In [133]:
# Put your code

       food     value type
0     bacon -0.781627  pig
1     Bacon  0.126815  pig
2       Ham  0.852046  pig
3      beef -1.920844  cow
4  pastrami  0.772290  cow

#### สามารถเขียนสั้น ๆ ด้วยบรรทัดเดียว !!

In [137]:
data['food'].map(lambda x: mapping[x.lower()])

0    pig
1    pig
2    pig
3    cow
4    cow
Name: food, dtype: object

### การ Replace ค่าใน Series

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.replace.html#pandas.Series.replace

In [148]:
data = pd.Series([1., -999, 2, -999, -1000, 3])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

ทำการ replace ค่าใน Series ให้ค่า -999 เป็น NaN

In [141]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

ทำการ replace หลาย ๆ ค่าใน Series ให้ค่า -999 และ -1000 เป็น NaN

In [142]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

#### คำถาม ทำการ replace ค่าใน Series ดังนี้
* -999 เป็น NaN
* -1000 เป็น 0

In [145]:
# Put your code

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Detecting and Filtering Outliers

เรื่องของ outliers เป็นสิ่งที่เกิดขึ้นในข้อมูลที่มีขนาดใหญ่ โดยที่ outliers มีทั้งข้อดีและข้อเสีย

https://docs.scipy.org/doc/numpy/reference/generated/numpy.any.html

In [180]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001910    -0.045639     0.016914     0.038591
std       1.026567     1.012023     0.981854     1.032888
min      -3.237389    -3.305439    -3.029343    -3.132471
25%      -0.692215    -0.738795    -0.639649    -0.624692
50%      -0.038799    -0.049182     0.005547     0.038544
75%       0.697554     0.621135     0.709930     0.743897
max       2.952021     3.589620     2.976895     3.097722

ทำการหาข้อมูลใน column ที่ 2 ซึ่งมีค่ามากกว่า 2.5

In [181]:
column = data[2]
column[np.abs(column) > 2.5]

24    -2.788071
95     2.976895
283    2.733812
433    2.765540
456   -2.548951
519    2.590866
637   -2.517219
682    2.508739
766   -2.997829
838   -3.029343
914   -2.574089
Name: 2, dtype: float64

In [182]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
74   0.032933 -3.305439  0.704624  0.089991
85  -0.326816  0.706219  0.052189 -3.132471
92  -0.465365  3.106735 -0.732816  0.858151
95  -0.521540  3.589620  2.976895 -0.660732
327  0.481210 -0.854805 -0.114069 -3.018871
396  1.733201  3.130922  0.407297  0.681365
544 -1.457695  0.841560  0.054749  3.097722
754 -0.241933 -3.002122  0.893909 -0.206688
838  1.135904 -1.186726 -3.029343 -1.416435
917 -3.061753 -0.580768 -0.046399 -0.458473
978 -3.237389  0.629540  1.137800 -0.012918

In [183]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0 -1.0

### ถ้าต้องการข้อมูลที่อยู่ระหว่างค่า -3 ถึง 3 จะทำอย่างไร ?

In [184]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001611    -0.046158     0.016943     0.038645
std       1.025662     1.008393     0.981763     1.032148
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.692215    -0.738795    -0.639649    -0.624692
50%      -0.038799    -0.049182     0.005547     0.038544
75%       0.697554     0.621135     0.709930     0.743897
max       2.952021     3.000000     2.976895     3.000000

### การ random sampling ข้อมูล

โดยที่ Numpy library จะมี numpy.random.permutation() ให้ใช้งาน จะทำการ random ตัวเลขออกมาใช้รูปแบบ list ตามจำนวนที่ต้องการ

In [202]:
# Create DataFrame
data = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
data

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [203]:
# ทำการ random ตัวเลข สำหรับเลือก index ใน DataFrame
sampler = np.random.permutation(5)
sampler

array([1, 4, 0, 3, 2])

In [204]:
# ดึงข้อมูลจาก DataFrame
data.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [214]:
# ทำการ ramdom ข้อมูลจาก sampling data
data.sample(n=2)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7

## การจัดการข้อมูล String

ในภาษา Python นั้นมี library และ function สำหรับการจัดการข้อมูลชนิด String จำนวนมากและง่ายอีกด้วย

ดังนั้นมาเรียนรู้วิธีการจัดการข้อมูลกันหน่อยทั้ง Python standard library และ Pandas

### 1. การจัดการด้วย function ใน String object ของภาษา Python

https://docs.python.org/3/library/string.html

In [215]:
name = 'A, B,   C,D   '
name

'A, B,   C,D   '

In [216]:
name.split(',')

['A', ' B', '   C', 'D   ']

ข้อมูลที่ได้นั้นทำการแยกด้วย comma(,) แต่ข้อมูลพวก whitespace เช่น spacebar ไม่ได้ถูกเอาออกไป

สามารถเขียนด้วยภาษา Python ได้ดังนี้ (List comprehensive)

In [219]:
new_names = [ x.strip() for x in name.split(',') ]
new_names

['A', 'B', 'C', 'D']

#### คำถาม ทำการเชื่อมต่อข้อมูลใน new_names ด้วยเครื่องหมาย :  ?

'A:B:C:D'

### 2 การใช้งาน Pandas library

โดยที่ Pandas library สามารถทำงานร่วมกับ String library ของ Python standard ได้เป็นอย่างดี

มาดูตัวอย่างการใช้งานกัน

In [246]:
data = pd.DataFrame({ 'name': ['A', 'B', 'C'],
                      'email': ['A@google.com', 'B@gmail.com', np.nan]
                    }
                   )
data

          email name
0  A@google.com    A
1   B@gmail.com    B
2           NaN    C

In [232]:
# Put your code
data

  name         email
0    A  A@google.com
1    B   B@gmail.com
2    C           NaN

In [236]:
# Check NaN in DataFrame
data.isnull()

   email   name
0  False  False
1  False  False
2   True  False

#### สิ่งที่ต้องการคือ ทำการตรวจสอบว่า email มีคำว่า gmail หรือไม่ ?

In [237]:
data.email.str.contains('gmail')

0    False
1     True
2      NaN
Name: email, dtype: object

In [247]:
data['test gmail'] = data.email.str.contains('gmail')
data

          email name test gmail
0  A@google.com    A      False
1   B@gmail.com    B       True
2           NaN    C        NaN

In [253]:
# Slicing data
data.email.str[:4]

0    A@go
1    B@gm
2     NaN
Name: email, dtype: object

In [255]:
# Put your code
data

  email name test gmail
0  A@go    A      False
1  B@gm    B       True
2   NaN    C        NaN